bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L552.svd
        <register>
          <name>FMC_BTR4</name>
          <displayName>FMC_BTR4</displayName>
          <description>FMC_BTR4</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration These bits
                are written by software to define the duration of the
                address setup phase (refer to Figure81 to Figure93),
                used in SRAMs, ROMs and asynchronous NOR Flash: For
                each access mode address setup phase duration, please
                refer to the respective figure (refer to Figure81 to
                Figure93). Note: In synchronous accesses, this value
                is dont care. In Muxed mode or Mode D, the minimum
                value for ADDSET is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in mode D or multiplexed accesses: For each
                access mode address-hold phase duration, please refer
                to the respective figure (Figure81 to Figure93).
                Note: In synchronous accesses, this value is not
                used, the address hold phase is always 1 memory clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous accesses: For each memory type and
                access mode data-phase duration, please refer to the
                respective figure (Figure81 to Figure93). Example:
                Mode1, write access, DATAST=1: Data-phase duration=
                DATAST+1 = 2 KCK_FMC clock cycles. Note: In
                synchronous accesses, this value is dont
                care.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write-to-read or read-to write transaction. The
                programmed bus turnaround delay is inserted between
                an asynchronous read (in muxed or mode D) or write
                transaction and any other asynchronous /synchronous
                read/write from/to a static bank. If a read operation
                is performed, the bank can be the same or a different
                one, whereas it must be different in case of write
                operation to the bank, except in muxed mode or mode
                D. In some cases, whatever the programmed BUSTRUN
                values, the bus turnaround delay is fixed as follows:
                The bus turnaround delay is not inserted between two
                consecutive asynchronous write transfers to the same
                static memory bank except in muxed mode and mode D.
                There is a bus turnaround delay of 1 FMC clock cycle
                between: Two consecutive asynchronous read transfers
                to the same static memory bank except for modes muxed
                and D. An asynchronous read to an asynchronous or
                synchronous write to any static bank or dynamic bank
                except in modes muxed and D mode. There is a bus
                turnaround delay of 2 FMC clock cycle between: Two
                consecutive synchronous write operations (in Burst or
                Single mode) to the same bank. A synchronous write
                (burst or single) access and an asynchronous write or
                read transfer to or from static memory bank (the bank
                can be the same or a different one in case of a read
                operation. Two consecutive synchronous read
                operations (in Burst or Single mode) followed by any
                synchronous/asynchronous read or write from/to
                another static memory bank. There is a bus turnaround
                delay of 3 FMC clock cycle between: Two consecutive
                synchronous write operations (in Burst or Single
                mode) to different static banks. A synchronous write
                access (in Burst or Single mode) and a synchronous
                read from the same or a different bank. The bus
                turnaround delay allows to match the minimum time
                between consecutive transactions (tEHEL from NEx high
                to NEx low) and the maximum time required by the
                memory to free the data bus after a read access
                (tEHQZ): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin and (BUSTRUN + 2)KCK_FMC period &amp;#8805;
                tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period
                &amp;#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126.
                ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>
                Clock divide ratio (for FMC_CLK signal)
                These bits define the period of FMC_CLK clock output
                signal, expressed in number of KCK_FMC cycles: In
                asynchronous NOR Flash, SRAM or PSRAM accesses, this
                value is dont care. Note: Refer to Section20.6.5:
                Synchronous transactions for FMC_CLK divider ratio
                formula)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>
                Data latency for synchronous memory For
                synchronous access with read write burst mode enabled
                these bits define the number of memory clock
                cycles
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode These bits specify the
                asynchronous access modes as shown in the timing
                diagrams. They are taken into account only when the
                EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>DATAHLD</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_PCR</name>
          <displayName>FMC_PCR</displayName>
          <description>NAND Flash control registers</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>PWAITEN</name>
              <description>
                Wait feature enable bit. This bit
                enables the Wait feature for the NAND Flash memory
                bank:
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBKEN</name>
              <description>
                NAND Flash memory bank enable bit. This
                bit enables the memory bank. Accessing a disabled
                memory bank causes an ERROR on AXI bus
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTYP</name>
              <description>Memory type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWID</name>
              <description>
                Data bus width. These bits define the
                external memory device width.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ECCEN</name>
              <description>
                ECC computation logic enable
                bit
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLR</name>
              <description>
                CLE to RE delay. These bits set time
                from CLE low to RE low in number of KCK_FMC clock
                cycles. The time is give by the following formula:
                t_clr = (TCLR + SET + 2) TKCK_FMC where TKCK_FMC is
                the KCK_FMC clock period Note: Set is MEMSET or
                ATTSET according to the addressed
                space.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TAR</name>
              <description>
                ALE to RE delay. These bits set time
                from ALE low to RE low in number of KCK_FMC clock
                cycles. Time is: t_ar = (TAR + SET + 2) TKCK_FMC
                where TKCK_FMC is the FMC clock period Note: Set is
                MEMSET or ATTSET according to the addressed
                space.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ECCPS</name>
              <description>
                ECC page size. These bits define the
                page size for the extended ECC:
              </description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_SR</name>
          <displayName>FMC_SR</displayName>
          <description>
            This register contains information about the
            FIFO status and interrupt. The FMC features a FIFO that
            is used when writing to memories to transfer up to 16
            words of data.This is used to quickly write to the FIFO
            and free the AXI bus for transactions to peripherals
            other than the FMC, while the FMC is draining its FIFO
            into the memory. One of these register bits indicates the
            status of the FIFO, for ECC purposes.The ECC is
            calculated while the data are written to the memory. To
            read the correct ECC, the software must consequently wait
            until the FIFO is empty.
          </description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>IRS</name>
              <description>
                Interrupt rising edge status The flag is
                set by hardware and reset by software. Note: If this
                bit is written by software to 1 it will be
                set.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILS</name>
              <description>
                Interrupt high-level status The flag is
                set by hardware and reset by software.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFS</name>
              <description>
                Interrupt falling edge status The flag
                is set by hardware and reset by software. Note: If
                this bit is written by software to 1 it will be
                set.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREN</name>
              <description>
                Interrupt rising edge detection enable
                bit
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILEN</name>
              <description>
                Interrupt high-level detection enable
                bit
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFEN</name>
              <description>
                Interrupt falling edge detection enable
                bit
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEMPT</name>
              <description>
                FIFO empty. Read-only bit that provides
                the status of the FIFO
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_PMEM</name>
          <displayName>FMC_PMEM</displayName>
          <description>
            The FMC_PMEM read/write register contains
            the timing information for NAND Flash memory bank. This
            information is used to access either the common memory
            space of the NAND Flash for command, address write access
            and data read/write access.
          </description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMSET</name>
              <description>
                Common memory x setup time These bits
                define the number of KCK_FMC (+1) clock cycles to set
                up the address before the command assertion (NWE,
                NOE), for NAND Flash read or write access to common
                memory space:
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>
                Common memory wait time These bits
                define the minimum number of KCK_FMC (+1) clock
                cycles to assert the command (NWE, NOE), for NAND
                Flash read or write access to common memory space.
                The duration of command assertion is extended if the
                wait signal (NWAIT) is active (low) at the end of the
                programmed value of KCK_FMC:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>
                Common memory hold time These bits
                define the number of KCK_FMC clock cycles for write
                accesses and KCK_FMC+1 clock cycles for read accesses
                during which the address is held (and data for write
                accesses) after the command is de-asserted (NWE,
                NOE), for NAND Flash read or write access to common
                memory space:
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHIZ</name>
              <description>
                Common memory x data bus Hi-Z time These
                bits define the number of KCK_FMC clock cycles during
                which the data bus is kept Hi-Z after the start of a
                NAND Flash write access to common memory space. This
                is only valid for write transactions:
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_PATT</name>
          <displayName>FMC_PATT</displayName>
          <description>
            The FMC_PATT read/write register contains
            the timing information for NAND Flash memory bank. It is
            used for 8-bit accesses to the attribute memory space of
            the NAND Flash for the last address write access if the
            timing must differ from that of previous accesses (for
            Ready/Busy management, refer to Section20.8.5: NAND Flash
            prewait feature).
          </description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTSET</name>
              <description>
                Attribute memory setup time These bits
                define the number of KCK_FMC (+1) clock cycles to set
                up address before the command assertion (NWE, NOE),
                for NAND Flash read or write access to attribute
                memory space:
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>
                Attribute memory wait time These bits
                define the minimum number of x KCK_FMC (+1) clock
                cycles to assert the command (NWE, NOE), for NAND
                Flash read or write access to attribute memory space.
                The duration for command assertion is extended if the
                wait signal (NWAIT) is active (low) at the end of the
                programmed value of KCK_FMC:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>
                Attribute memory hold time These bits
                define the number of KCK_FMC clock cycles during
                which the address is held (and data for write access)
                after the command de-assertion (NWE, NOE), for NAND
                Flash read or write access to attribute memory
                space:
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHIZ</name>
              <description>
                Attribute memory data bus Hi-Z time
                These bits define the number of KCK_FMC clock cycles
                during which the data bus is kept in Hi-Z after the
                start of a NAND Flash write access to attribute
                memory space on socket. Only valid for writ
                transaction:
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_ECCR</name>
          <displayName>FMC_ECCR</displayName>
          <description>
            This register contain the current error
            correction code value computed by the ECC computation
            modules of the FMC NAND controller. When the CPU
            reads/writes the data from a NAND Flash memory page at
            the correct address (refer to Section20.8.6: Computation
            of the error correction code (ECC) in NAND Flash memory),
            the data read/written from/to the NAND Flash memory are
            processed automatically by the ECC computation module.
            When X bytes have been read (according to the ECCPS field
            in the FMC_PCR registers), the CPU must read the computed
            ECC value from the FMC_ECC registers. It then verifies if
            these computed parity data are the same as the parity
            value recorded in the spare area, to determine whether a
            page is valid, and, to correct it otherwise. The FMC_ECCR
            register should be cleared after being read by setting
            the ECCEN bit to 0. To compute a new data block, the
            ECCEN bit must be set to 1.
          </description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>
                ECC result This field contains the value
                computed by the ECC computation logic. Table167
                describes the contents of these bit
                fields.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
