bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L552.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>SEC_RNG</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x520C0800</baseAddress>
    </peripheral>
    <peripheral>
      <name>SDMMC1</name>
      <description>SDMMC1</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x420C8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3FD</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDMMC1</name>
        <description>SDMMC1 global interrupt</description>
        <value>78</value>
      </interrupt>
      <registers>
        <register>
          <name>SDMMC_POWER</name>
          <displayName>SDMMC_POWER</displayName>
          <description>SDMMC power control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRCTRL</name>
              <description>
                SDMMC state control bits. These bits can
                only be written when the SDMMC is not in the power-on
                state (PWRCTRL?11). These bits are used to define the
                functional state of the SDMMC signals: Any further
                write will be ignored, PWRCTRL value will keep
                11.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VSWITCH</name>
              <description>
                Voltage switch sequence start. This bit
                is used to start the timing critical section of the
                voltage switch sequence:
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWITCHEN</name>
              <description>
                Voltage switch procedure enable. This
                bit can only be written by firmware when CPSM is
                disabled (CPSMEN = 0). This bit is used to stop the
                SDMMC_CK after the voltage switch command
                response:
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIRPOL</name>
              <description>
                Data and command direction signals
                polarity selection. This bit can only be written when
                the SDMMC is in the power-off state (PWRCTRL =
                00).
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_CLKCR</name>
          <displayName>SDMMC_CLKCR</displayName>
          <description>
            The SDMMC_CLKCR register controls the
            SDMMC_CK output clock, the SDMMC_RX_CLK receive clock,
            and the bus width.
          </description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>
                Clock divide factor This bit can only be
                written when the CPSM and DPSM are not active
                (CPSMACT = 0 and DPSMACT = 0). This field defines the
                divide factor between the input clock (SDMMCCLK) and
                the output clock (SDMMC_CK): SDMMC_CK frequency =
                SDMMCCLK / [2 * CLKDIV]. 0xx: etc.. xxx:
                etc..
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PWRSAV</name>
              <description>
                Power saving configuration bit This bit
                can only be written when the CPSM and DPSM are not
                active (CPSMACT = 0 and DPSMACT = 0) For power
                saving, the SDMMC_CK clock output can be disabled
                when the bus is idle by setting PWRSAV:
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIDBUS</name>
              <description>
                Wide bus mode enable bit This bit can
                only be written when the CPSM and DPSM are not active
                (CPSMACT = 0 and DPSMACT = 0)
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NEGEDGE</name>
              <description>
                SDMMC_CK dephasing selection bit for
                data and Command. This bit can only be written when
                the CPSM and DPSM are not active (CPSMACT = 0 and
                DPSMACT = 0). When clock division = 1 (CLKDIV = 0),
                this bit has no effect. Data and Command change on
                SDMMC_CK falling edge. When clock division &amp;gt;1
                (CLKDIV &amp;gt; 0) &amp;amp; DDR = 0: - SDMMC_CK
                edge occurs on SDMMCCLK rising edge. When clock
                division &gt;1 (CLKDIV &gt; 0) &amp; DDR = 1: - Data
                changed on the SDMMCCLK falling edge succeeding a
                SDMMC_CK edge. - SDMMC_CK edge occurs on SDMMCCLK
                rising edge. - Data changed on the SDMMC_CK falling
                edge succeeding a SDMMC_CK edge. - SDMMC_CK edge
                occurs on SDMMCCLK rising edge.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWFC_EN</name>
              <description>
                Hardware flow control enable This bit
                can only be written when the CPSM and DPSM are not
                active (CPSMACT = 0 and DPSMACT = 0) When Hardware
                flow control is enabled, the meaning of the TXFIFOE
                and RXFIFOF flags change, please see SDMMC status
                register definition in Section56.8.11.
              </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDR</name>
              <description>
                Data rate signaling selection This bit
                can only be written when the CPSM and DPSM are not
                active (CPSMACT = 0 and DPSMACT = 0) DDR rate shall
                only be selected with 4-bit or 8-bit wide bus mode.
                (WIDBUS &amp;gt; 00). DDR = 1 has no effect when
                WIDBUS = 00 (1-bit wide bus). DDR rate shall only be
                selected with clock division &amp;gt;1. (CLKDIV
                &amp;gt; 0)
              </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSSPEED</name>
              <description>
                Bus speed mode selection between DS, HS,
                SDR12, SDR25 and SDR50, DDR50, SDR104. This bit can
                only be written when the CPSM and DPSM are not active
                (CPSMACT = 0 and DPSMACT = 0)
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELCLKRX</name>
              <description>
                Receive clock selection. These bits can
                only be written when the CPSM and DPSM are not active
                (CPSMACT = 0 and DPSMACT = 0)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_ARGR</name>
          <displayName>SDMMC_ARGR</displayName>
          <description>
            The SDMMC_ARGR register contains a 32-bit
            command argument, which is sent to a card as part of a
            command message.
          </description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>
                Command argument. These bits can only be
                written by firmware when CPSM is disabled (CPSMEN =
                0). Command argument sent to a card as part of a
                command message. If a command contains an argument,
                it must be loaded into this register before writing a
                command to the command register.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_CMDR</name>
          <displayName>SDMMC_CMDR</displayName>
          <description>
            The SDMMC_CMDR register contains the command
            index and command type bits. The command index is sent to
            a card as part of a command message. The command type
            bits control the command path state machine
            (CPSM).
          </description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDINDEX</name>
              <description>
                Command index. This bit can only be
                written by firmware when CPSM is disabled (CPSMEN =
                0). The command index is sent to the card as part of
                a command message.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CMDTRANS</name>
              <description>
                The CPSM treats the command as a data
                transfer command, stops the interrupt period, and
                signals DataEnable to the DPSM This bit can only be
                written by firmware when CPSM is disabled (CPSMEN =
                0). If this bit is set, the CPSM issues an end of
                interrupt period and issues DataEnable signal to the
                DPSM when the command is sent.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSTOP</name>
              <description>
                The CPSM treats the command as a Stop
                Transmission command and signals Abort to the DPSM.
                This bit can only be written by firmware when CPSM is
                disabled (CPSMEN = 0). If this bit is set, the CPSM
                issues the Abort signal to the DPSM when the command
                is sent.
              </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITRESP</name>
              <description>
                Wait for response bits. This bit can
                only be written by firmware when CPSM is disabled
                (CPSMEN = 0). They are used to configure whether the
                CPSM is to wait for a response, and if yes, which
                kind of response.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WAITINT</name>
              <description>
                CPSM waits for interrupt request. If
                this bit is set, the CPSM disables command timeout
                and waits for an card interrupt request (Response).
                If this bit is cleared in the CPSM Wait state, will
                cause the abort of the interrupt mode.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPEND</name>
              <description>
                CPSM Waits for end of data transfer
                (CmdPend internal signal) from DPSM. This bit when
                set, the CPSM waits for the end of data transfer
                trigger before it starts sending a command. WAITPEND
                is only taken into account when DTMODE = MMC stream
                data transfer, WIDBUS = 1-bit wide bus mode, DPSMACT
                = 1 and DTDIR = from host to card.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSMEN</name>
              <description>
                Command path state machine (CPSM) Enable
                bit This bit is written 1 by firmware, and cleared by
                hardware when the CPSM enters the Idle state. If this
                bit is set, the CPSM is enabled. When DTEN = 1, no
                command will be transfered nor boot procedure will be
                started. CPSMEN is cleared to 0.
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTHOLD</name>
              <description>
                Hold new data block transmission and
                reception in the DPSM. If this bit is set, the DPSM
                will not move from the Wait_S state to the Send state
                or from the Wait_R state to the Receive
                state.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTMODE</name>
              <description>
                Select the boot mode procedure to be
                used. This bit can only be written by firmware when
                CPSM is disabled (CPSMEN = 0)
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTEN</name>
              <description>
                Enable boot mode
                procedure.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSUSPEND</name>
              <description>
                The CPSM treats the command as a Suspend
                or Resume command and signals interrupt period
                start/end. This bit can only be written by firmware
                when CPSM is disabled (CPSMEN = 0). CMDSUSPEND = 1
                and CMDTRANS = 0 Suspend command, start interrupt
                period when response bit BS=0. CMDSUSPEND = 1 and
                CMDTRANS = 1 Resume command with data, end interrupt
                period when response bit DF=1.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_RESP1R</name>
          <displayName>SDMMC_RESP1R</displayName>
          <description>
            The SDMMC_RESP1/2/3/4R registers contain the
            status of a card, which is part of the received
            response.
          </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS1</name>
              <description>see Table 432</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_RESP2R</name>
          <displayName>SDMMC_RESP2R</displayName>
          <description>
            The SDMMC_RESP1/2/3/4R registers contain the
            status of a card, which is part of the received
            response.
          </description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS2</name>
              <description>see Table404.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_RESP3R</name>
          <displayName>SDMMC_RESP3R</displayName>
          <description>
            The SDMMC_RESP1/2/3/4R registers contain the
            status of a card, which is part of the received
            response.
          </description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS3</name>
              <description>see Table404.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_RESP4R</name>
          <displayName>SDMMC_RESP4R</displayName>
          <description>
            The SDMMC_RESP1/2/3/4R registers contain the
            status of a card, which is part of the received
            response.
          </description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS4</name>
              <description>see Table404.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_DTIMER</name>
          <displayName>SDMMC_DTIMER</displayName>
          <description>
            The SDMMC_DTIMER register contains the data
            timeout period, in card bus clock periods. A counter
            loads the value from the SDMMC_DTIMER register, and
            starts decrementing when the data path state machine
            (DPSM) enters the Wait_R or Busy state. If the timer
            reaches 0 while the DPSM is in either of these states,
            the timeout status flag is set.
          </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATATIME</name>
              <description>
                Data and R1b busy timeout period This
                bit can only be written when the CPSM and DPSM are
                not active (CPSMACT = 0 and DPSMACT = 0). Data and
                R1b busy timeout period expressed in card bus clock
                periods.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_DLENR</name>
          <displayName>SDMMC_DLENR</displayName>
          <description>
            The SDMMC_DLENR register contains the number
            of data bytes to be transferred. The value is loaded into
            the data counter when data transfer starts.
          </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATALENGTH</name>
              <description>
                Data length value This register can only
                be written by firmware when DPSM is inactive (DPSMACT
                = 0). Number of data bytes to be transferred. When
                DDR = 1 DATALENGTH is truncated to a multiple of 2.
                (The last odd byte is not transfered) When DATALENGTH
                = 0 no data will be transfered, when requested by a
                CPSMEN and CMDTRANS = 1 also no command will be
                transfered. DTEN and CPSMEN are cleared to
                0.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
