bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L552.svd
        <register>
          <name>SDMMC_DCTRL</name>
          <displayName>SDMMC_DCTRL</displayName>
          <description>
            The SDMMC_DCTRL register control the data
            path state machine (DPSM).
          </description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTEN</name>
              <description>
                Data transfer enable bit This bit can
                only be written by firmware when DPSM is inactive
                (DPSMACT = 0). This bit is cleared by Hardware when
                data transfer completes. This bit shall only be used
                to transfer data when no associated data transfer
                command is used, i.e. shall not be used with SD or
                eMMC cards.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTDIR</name>
              <description>
                Data transfer direction selection This
                bit can only be written by firmware when DPSM is
                inactive (DPSMACT = 0).
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTMODE</name>
              <description>
                Data transfer mode selection. This bit
                can only be written by firmware when DPSM is inactive
                (DPSMACT = 0).
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DBLOCKSIZE</name>
              <description>
                Data block size This bit can only be
                written by firmware when DPSM is inactive (DPSMACT =
                0). Define the data block length when the block data
                transfer mode is selected: When DATALENGTH is not a
                multiple of DBLOCKSIZE, the transfered data is
                truncated at a multiple of DBLOCKSIZE. (Any remain
                data will not be transfered.) When DDR = 1,
                DBLOCKSIZE = 0000 shall not be used. (No data will be
                transfered)
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RWSTART</name>
              <description>
                Read wait start. If this bit is set,
                read wait operation starts.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWSTOP</name>
              <description>
                Read wait stop This bit is written by
                firmware and auto cleared by hardware when the DPSM
                moves from the READ_WAIT state to the WAIT_R or IDLE
                state.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWMOD</name>
              <description>
                Read wait mode. This bit can only be
                written by firmware when DPSM is inactive (DPSMACT =
                0).
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOEN</name>
              <description>
                SD I/O interrupt enable functions This
                bit can only be written by firmware when DPSM is
                inactive (DPSMACT = 0). If this bit is set, the DPSM
                enables the SD I/O card specific interrupt
                operation.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTACKEN</name>
              <description>
                Enable the reception of the boot
                acknowledgment. This bit can only be written by
                firmware when DPSM is inactive (DPSMACT =
                0).
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFORST</name>
              <description>
                FIFO reset, will flush any remaining
                data. This bit can only be written by firmware when
                IDMAEN= 0 and DPSM is active (DPSMACT = 1). This bit
                will only take effect when a transfer error or
                transfer hold occurs.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_DCNTR</name>
          <displayName>SDMMC_DCNTR</displayName>
          <description>
            The SDMMC_DCNTR register loads the value
            from the data length register (see SDMMC_DLENR) when the
            DPSM moves from the Idle state to the Wait_R or Wait_S
            state. As data is transferred, the counter decrements the
            value until it reaches 0. The DPSM then moves to the Idle
            state and when there has been no error, the data status
            end flag (DATAEND) is set.
          </description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATACOUNT</name>
              <description>
                Data count value When read, the number
                of remaining data bytes to be transferred is
                returned. Write has no effect.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_STAR</name>
          <displayName>SDMMC_STAR</displayName>
          <description>
            The SDMMC_STAR register is a read-only
            register. It contains two types of flag:Static flags
            (bits [29,21,11:0]): these bits remain asserted until
            they are cleared by writing to the SDMMC interrupt Clear
            register (see SDMMC_ICR)Dynamic flags (bits [20:12]):
            these bits change state depending on the state of the
            underlying logic (for example, FIFO full and empty flags
            are asserted and de-asserted as data while written to the
            FIFO)
          </description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAIL</name>
              <description>
                Command response received (CRC check
                failed). Interrupt flag is cleared by writing
                corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAIL</name>
              <description>
                Data block sent/received (CRC check
                failed). Interrupt flag is cleared by writing
                corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUT</name>
              <description>
                Command response timeout. Interrupt flag
                is cleared by writing corresponding interrupt clear
                bit in SDMMC_ICR. The Command Timeout period has a
                fixed value of 64 SDMMC_CK clock
                periods.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUT</name>
              <description>
                Data timeout. Interrupt flag is cleared
                by writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERR</name>
              <description>
                Transmit FIFO underrun error or IDMA
                read transfer error. Interrupt flag is cleared by
                writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERR</name>
              <description>
                Received FIFO overrun error or IDMA
                write transfer error. Interrupt flag is cleared by
                writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDREND</name>
              <description>
                Command response received (CRC check
                passed, or no CRC). Interrupt flag is cleared by
                writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENT</name>
              <description>
                Command sent (no response required).
                Interrupt flag is cleared by writing corresponding
                interrupt clear bit in SDMMC_ICR.
              </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAEND</name>
              <description>
                Data transfer ended correctly. (data
                counter, DATACOUNT is zero and no errors occur).
                Interrupt flag is cleared by writing corresponding
                interrupt clear bit in SDMMC_ICR.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLD</name>
              <description>
                Data transfer Hold. Interrupt flag is
                cleared by writing corresponding interrupt clear bit
                in SDMMC_ICR.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKEND</name>
              <description>
                Data block sent/received. (CRC check
                passed) and DPSM moves to the READWAIT state.
                Interrupt flag is cleared by writing corresponding
                interrupt clear bit in SDMMC_ICR.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORT</name>
              <description>
                Data transfer aborted by CMD12.
                Interrupt flag is cleared by writing corresponding
                interrupt clear bit in SDMMC_ICR.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPSMACT</name>
              <description>
                Data path state machine active, i.e. not
                in Idle state. This is a hardware status flag only,
                does not generate an interrupt.
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSMACT</name>
              <description>
                Command path state machine active, i.e.
                not in Idle state. This is a hardware status flag
                only, does not generate an interrupt.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOHE</name>
              <description>
                Transmit FIFO half empty At least half
                the number of words can be written into the FIFO.
                This bit is cleared when the FIFO becomes half+1
                full.
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOHF</name>
              <description>
                Receive FIFO half full There are at
                least half the number of words in the FIFO. This bit
                is cleared when the FIFO becomes half+1
                empty.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOF</name>
              <description>
                Transmit FIFO full This is a hardware
                status flag only, does not generate an interrupt.
                This bit is cleared when one FIFO location becomes
                empty.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOF</name>
              <description>
                Receive FIFO full This bit is cleared
                when one FIFO location becomes empty.
              </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOE</name>
              <description>
                Transmit FIFO empty This bit is cleared
                when one FIFO location becomes full.
              </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOE</name>
              <description>
                Receive FIFO empty This is a hardware
                status flag only, does not generate an interrupt.
                This bit is cleared when one FIFO location becomes
                full.
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0</name>
              <description>
                Inverted value of SDMMC_D0 line (Busy),
                sampled at the end of a CMD response and a second
                time 2 SDMMC_CK cycles after the CMD response. This
                bit is reset to not busy when the SDMMCD0 line
                changes from busy to not busy. This bit does not
                signal busy due to data transfer. This is a hardware
                status flag only, it does not generate an
                interrupt.
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0END</name>
              <description>
                end of SDMMC_D0 Busy following a CMD
                response detected. This indicates only end of busy
                following a CMD response. This bit does not signal
                busy due to data transfer. Interrupt flag is cleared
                by writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOIT</name>
              <description>
                SDIO interrupt received. Interrupt flag
                is cleared by writing corresponding interrupt clear
                bit in SDMMC_ICR.
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAIL</name>
              <description>
                Boot acknowledgment received (boot
                acknowledgment check fail). Interrupt flag is cleared
                by writing corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUT</name>
              <description>
                Boot acknowledgment timeout. Interrupt
                flag is cleared by writing corresponding interrupt
                clear bit in SDMMC_ICR.
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWEND</name>
              <description>
                Voltage switch critical timing section
                completion. Interrupt flag is cleared by writing
                corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOP</name>
              <description>
                SDMMC_CK stopped in Voltage switch
                procedure. Interrupt flag is cleared by writing
                corresponding interrupt clear bit in
                SDMMC_ICR.
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMATE</name>
              <description>
                IDMA transfer error. Interrupt flag is
                cleared by writing corresponding interrupt clear bit
                in SDMMC_ICR.
              </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTC</name>
              <description>
                IDMA buffer transfer complete. interrupt
                flag is cleared by writing corresponding interrupt
                clear bit in SDMMC_ICR.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
