bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L552.svd
        <register>
          <name>SDMMC_FIFOR</name>
          <displayName>SDMMC_FIFOR</displayName>
          <description>
            The receive and transmit FIFOs can be only
            read or written as word (32-bit) wide registers. The
            FIFOs contain 16 entries on sequential addresses. This
            allows the CPU to use its load and store multiple
            operands to read from/write to the FIFO.When accessing
            SDMMC_FIFOR with half word or byte access an AHB bus
            fault is generated.
          </description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFODATA</name>
              <description>
                Receive and transmit FIFO data This
                register can only be read or written by firmware when
                the DPSM is active (DPSMACT=1). The FIFO data
                occupies 16 entries of 32-bit words.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_VER</name>
          <displayName>SDMMC_VER</displayName>
          <description>SDMMC IP version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>IP minor revision number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>IP major revision number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_ID</name>
          <displayName>SDMMC_ID</displayName>
          <description>
            SDMMC IP identification
            register
          </description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00140022</resetValue>
          <fields>
            <field>
              <name>IP_ID</name>
              <description>SDMMC IP identification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_RESPCMDR</name>
          <displayName>SDMMC_RESPCMDR</displayName>
          <description>
            SDMMC command response
            register
          </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>RESPCMD</name>
              <description>Response command index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SEC_SDMMC1</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x520C8000</baseAddress>
    </peripheral>
  </peripherals>
</device>
